{"metadata":{"title":"Lora","role":"article","roleHeading":"Article"},"hierarchy":{"paths":[["doc:\/\/DrawThings\/documentation\/root"]]},"kind":"article","schemaVersion":{"minor":3,"patch":0,"major":0},"sections":[],"identifier":{"interfaceLanguage":"swift","url":"doc:\/\/DrawThings\/documentation\/DrawThings\/3.LoRa"},"primaryContentSections":[{"kind":"content","content":[{"level":2,"type":"heading","anchor":"Everything-about-Lora-and-training-your-own-Lora-model","text":"Everything about Lora and training your own Lora model"},{"inlineContent":[{"text":"F_R_O_S_T_Y","type":"text"}],"type":"paragraph"},{"inlineContent":[{"text":"Limitation now is minimum of iPad with 8GB of RAM for 1.5 models Lora, use 8 bit models  and network dim not higher then default. iPhone 15 PRO models can crash when training, but you can try it with 8 bit model and network dim set to 8. For SDXL Lora  you will need powerful hardware with lot of RAM.","type":"text"}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"For everyone interested in Lora training, you can find some more info in ⁠🚝training-recipes-and-results"},{"type":"text","text":" "},{"type":"text","text":"Click the menu beside Lora in settings and here you can download premade Lora. When you click manage  you will be in list of all Lora. You can download\/delete them from here. Click to three dots to export\/create 8- bit model."}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"Second menu in the middle is import Lora . Same as model importing, you can select local file or import directly from civitai with the small green play button beside download and select draw things. Don’t forget to fill trigger word . This word will be added to the prompt. This word will trigger the Lora. And when you select Lora, under the menu will be slider to select Lora strength. You can select multiple Lora by click the plus button beside the selected Lora."}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"Last button is for Lora training. Here you can train your own Lora. Don’t forget to read all description here again . For base model you can select base 1.5 or realistic vision for realistic photos, anything for anime pictures etc. Depends what look or style you want to achieve. Trigger word  is the special word that trigger the Lora. It must be unique, don’t use word like “Bieber””, or it will mix your Lora with the singer photos. Other you can leave default until you get some experience. Training Steps, you can lower to 500-1000 for start and see the results. When you use lot of steps or high learning rate, you will overcook your model and it will generate burned pictures or noise only.  When you prefill the auto fill prompt before importing photos, the text here will fill all the imported photos. You can do good Lora with only 10 or 15 photos of the character or style. Don’t need hundreds. Better few good photos, then hundred of bad quality. Experiment or try other users settings."}],"type":"paragraph"},{"inlineContent":[{"type":"text","text":"You can also check YouTube tutorials about Lora training, you will find lot of them and get experience about how to train good Lora, most of the parameters are similar here like in automatic kohya-ss"}],"type":"paragraph"}]}],"references":{"doc://DrawThings/documentation/root":{"role":"article","title":"Draw Things","abstract":[{"type":"text","text":"Draw Things documetations and tutorials"}],"url":"\/documentation\/root","kind":"article","identifier":"doc:\/\/DrawThings\/documentation\/root","type":"topic"}}}